In [1]:
import pandas as pd

In [2]:
dic={'name':['james', 'tina','eric', 'mike', 'donald'], 'phone':['0910817850','0916173296','0999111222', '09888888888','0999111222'], 'email':['james@alcorlink.com', 'tina@tclink.com','erichsu@alcorlink.com', 'mike@alcorlink.com', 'donald@alcorlink.com']}
dic

{'name': ['james', 'tina', 'eric', 'mike', 'donald'],
 'phone': ['0910817850',
  '0916173296',
  '0999111222',
  '09888888888',
  '0999111222'],
 'email': ['james@alcorlink.com',
  'tina@tclink.com',
  'erichsu@alcorlink.com',
  'mike@alcorlink.com',
  'donald@alcorlink.com']}

In [3]:
df = pd.DataFrame(dic)

In [4]:
df

     name        phone                  email
0   james   0910817850    james@alcorlink.com
1    tina   0916173296        tina@tclink.com
2    eric   0999111222  erichsu@alcorlink.com
3    mike  09888888888     mike@alcorlink.com
4  donald   0999111222   donald@alcorlink.com

In [5]:
#####################################
# df.drop(1)                # rows / index
# df.drop('phone', axis=1)  # columns

#####################################
# df.shape                    # (rows, col)
# [row for row in df.index]   # iter obj of rows
# [col for col in df.columns] # iter obj of cols
# df.info()                   # shows row, indexes, and types
df.count()                    # count what? < items in cols >

name     5
phone    5
email    5
dtype: int64

In [6]:
#df['email']    # better, in case name is same as attribute of df. Ex: 'count'
df.email        #

0      james@alcorlink.com
1          tina@tclink.com
2    erichsu@alcorlink.com
3       mike@alcorlink.com
4     donald@alcorlink.com
Name: email, dtype: object

In [7]:
df.count()
# df.count

name     5
phone    5
email    5
dtype: int64

In [8]:
# df['name','phone']   # col name that's 'name','phone'  xxxxxx
df[['name','phone']]   # get multiple columns
[col for col in df.columns]  # ['name', 'phone', 'email']
df.columns                   # Index(['name', 'phone', 'email'], dtype='object')

Index(['name', 'phone', 'email'], dtype='object')

In [9]:
# <iloc> get rows by index 
df.iloc[0]      # get 1st   row
df.iloc[[0,1]]  # get multi rows

# 2nd arg: columns
df.iloc[[0,1],1]  # 1,2 row's 1st col

0    0910817850
1    0916173296
Name: phone, dtype: object

In [10]:
# loc combines with labels (later)
df.loc[0]     # get 1st row
df.loc[[0,1]] # get mult rows
df.loc[[0,1],'phone']
df.loc[0:2, 'phone']  # no brackets

0    0910817850
1    0916173296
2    0999111222
Name: phone, dtype: object

In [11]:
# set a column as index
df.set_index(df['name']) 
### NOTE ###  
# => df ususally doesn't do inplace,
# => inplace = True

          name        phone                  email
name
james    james   0910817850    james@alcorlink.com
tina      tina   0916173296        tina@tclink.com
eric      eric   0999111222  erichsu@alcorlink.com
mike      mike  09888888888     mike@alcorlink.com
donald  donald   0999111222   donald@alcorlink.com

In [12]:
filt = (df['phone'] == '0999111222')  # Filter mask, True...False
df['phone'] == '0999111222'

0    False
1    False
2     True
3    False
4     True
Name: phone, dtype: bool

In [13]:
df[filt]

     name       phone                  email
2    eric  0999111222  erichsu@alcorlink.com
4  donald  0999111222   donald@alcorlink.com

In [14]:
df.loc[filt]
df.loc[filt, 'email']

2    erichsu@alcorlink.com
4     donald@alcorlink.com
Name: email, dtype: object

In [15]:
df

     name        phone                  email
0   james   0910817850    james@alcorlink.com
1    tina   0916173296        tina@tclink.com
2    eric   0999111222  erichsu@alcorlink.com
3    mike  09888888888     mike@alcorlink.com
4  donald   0999111222   donald@alcorlink.com

In [16]:
df.rename(columns={'phone':'tele'}, inplace = True)

In [17]:
df

     name         tele                  email
0   james   0910817850    james@alcorlink.com
1    tina   0916173296        tina@tclink.com
2    eric   0999111222  erichsu@alcorlink.com
3    mike  09888888888     mike@alcorlink.com
4  donald   0999111222   donald@alcorlink.com

In [18]:
df.loc[2,'tele']  = '0888888'

In [19]:
df.loc[2, ['name','tele']] = ['eric2', '077777']
#df[filt, 'tele'] = '0aaa' # xxxx use loc

In [20]:
df

     name         tele                  email
0   james   0910817850    james@alcorlink.com
1    tina   0916173296        tina@tclink.com
2   eric2       077777  erichsu@alcorlink.com
3    mike  09888888888     mike@alcorlink.com
4  donald   0999111222   donald@alcorlink.com

In [40]:
df['name'] = df['name'].str.upper()
# df = df.drop('james', axis=1)
df['name'] = df['name'].str.lower()
df

     name         tele                  email
0   james   0910817850    james@alcorlink.com
1    tina   0916173296        tina@tclink.com
2   eric2       077777  erichsu@alcorlink.com
3    mike  09888888888     mike@alcorlink.com
4  donald   0999111222   donald@alcorlink.com

In [41]:
# apply
# map
# applymap
# replace

In [44]:
df['email'].apply(lambda s: s[:3])  # apply to columns....

0    jam
1    tin
2    eri
3    mik
4    don
Name: email, dtype: object

In [54]:
# james@alcorlink.com -> jmsa....(even chars)
[_ for idx, _ in enumerate("hello") if idx % 2 == 0]
df['email'].apply(lambda s: "".join([_ for idx, _ in enumerate(s) if idx % 2 == 0]))

0     jmsacrikcm
1       tn@cikcm
2    eihuacrikcm
3      mk@loln.o
4     dnl@loln.o
Name: email, dtype: object

In [56]:
df.apply(len)

name     5
tele     5
email    5
dtype: int64

In [58]:
df.apply(len, axis='columns') # axis = columns ==> How many columns?

0    3
1    3
2    3
3    3
4    3
dtype: int64